[
  {
    "id": 5,
    "header": "Microsoft Vancouver",
    "title": "Software Engineer II - Microsoft Teams",
    "start_date": "2021-05-10",
    "end_date": "2024-12-10",
    "links": [],
    "hard_skills": ["React", "TypeScript", "GraphQL"],
    "bullet_points": [
      "Implemented and shipped third‑party calling (Google Meet, Zoom, Webex, etc) via ”Join by ID” on Teams Rooms",
      "Delivered a new chat experience for Microsoft Teams Rooms (MTR) for Teams 2.1",
      "Conduct code reviews and suggest improvements to reduce redundancy and improve test coverage",
      "Drive feature development across various timezones by coordinating with designers, testers, and project managers",
      "Lead refactor effort in an egregious part of legacy UI for mounting MTR view panels",
      "Create and maintain Jest and Cypress tests to mitigate regressions before submission"
    ]
  },
  {
    "id": 4,
    "header": "Electronic Arts Canada",
    "title": "Web Developer - FIFA Ultimate Team Companion App",
    "start_date": "2017-09-28",
    "end_date": "2021-04-01",
    "links": [
      {
        "label": "iOS App Store",
        "href": "https://apps.apple.com/in/app/ea-sports-fc-25-companion/id1127108818"
      },
      {
        "label": "Google Play",
        "href": "https://play.google.com/store/apps/details?id=com.ea.gp.fifamobile"
      },
      {
        "label": "Web App",
        "href": "https://www.ea.com/ea-sports-fc/ultimate-team/web-app/"
      }
    ],
    "hard_skills": [
      "JavaScript",
      "LESS",
      "TypeScript",
      "Python",
      "Java",
      "REST"
    ],
    "bullet_points": [
      "Lead integration of brand‑new ’vanity’ items to FUT Companion App users in FIFA20, including nightly asset builds",
      "Planned, scoped, and implemented new features for current and future releases of the FIFA Ultimate Team Companion apps (FUT19 ‑ FUT21)",
      "Managed Live Content responsibilities such as coordinating roll‑outs of exclusive timed campaigns for FUT Companions",
      "Refactored legacy tools for parsing app metadata to reduce development overhead on CI pipeline",
      "Prevented content leaks, cut build times by exposing and resolving issues in 2D asset pipeline",
      "Interfaced with producers, developers, and testers across Live Content, Server, and Console teams in Canada and Romania"
    ]
  },
  {
    "id": 3,
    "header": "Electronic Arts Canada",
    "title": "Associate Technical Artist",
    "start_date": "2016-06-20",
    "end_date": "2017-09-27",
    "links": [],
    "hard_skills": [
      "C#",
      "Windows Presentation Foundation (WPF)",
      "Iron Python / FBScript",
      "Frostbite"
    ],
    "bullet_points": [
      "Create, deploy, and support existing Maya plugins and other packages used by artists on Rigging team, in C# and Python.",
      "Automate mass mesh weight transfers in C# Maya API.",
      "Leverage AGILE principles to plan and develop internal software for Rigging team.",
      "Collect and assess feedback on plugins from users.",
      "Fix visual bugs on assets and animations using node- and timeline-based editors in proprietary Frostbite engine."
    ]
  },
  {
    "id": 2,
    "header": "Tantalus Systems",
    "title": "Test Automation Engineer (Co-op)",
    "start_date": "2014-01-06",
    "end_date": "2014-08-29",
    "links": [],
    "hard_skills": ["Python", "Bottle.py", "jQuery", "Citrix Xen"],
    "bullet_points": [
      "Reduced setup time in regression testing of server features by automating triage work nightly",
      "Created tooling with Python lxml and etree to send build e‑mail notifications for high impact tickets",
      "Met daily with teammates to sync progress and design future plans for automation",
      "Managed Ubuntu and OEL VMs used as build machines and test environments"
    ]
  },
  {
    "id": 1,
    "header": "BlackBerry Canada (RIM)",
    "title": "Software Developer (Co-op)",
    "start_date": "2013-01-02",
    "end_date": "2013-08-30",
    "links": [],
    "hard_skills": ["VMWare vSphere", "Jenkins", "Ubuntu LTS"],
    "bullet_points": [
      "Oversaw deployment and automated testing of BES10 servers through Jenkins, Maven, Ant, and VMWare vSphere",
      "Created, deployed, and re‑tooled scripts used for production and maintenance of build config files",
      "Managed instances of test host machines using Windows Server and Ubuntu LTS VMs",
      "Investigated and validated new third‑party plugins for Hudson/Jenkins before deploying to Continuous Integration Team’s production server"
    ]
  }
]
