[
  {
    "id": 5,
    "header": "Microsoft Vancouver",
    "title": "Software Engineer - Microsoft Teams",
    "start_date": "2021-05-10",
    "end_date": "Current",
    "links": [],
    "hard_skills": [
      "TypeScript",
      "GraphQL"
    ],
    "bullet_points": [
      "Review, triage, and debug live site issues for Microsoft Teams Rooms (MTR) customers",
      "Prototype and implement new features for MTR using React",
      "Create and update unit tests for UI components to prevent unnecessary regressions",
      "Submit bug fixes to both the next-gen React and legacy Angular codebases for MS Teams"
    ]
  },
  {
    "id": 4,
    "header": "Electronic Arts Canada",
    "title": "Web Developer - FIFA Ultimate Team Companion App",
    "start_date": "2017-09-28",
    "end_date": "2021-04-01",
    "links": [
      {
        "label": "iOS App Store",
        "href": "https://apps.apple.com/us/app/ea-sports-fifa-20-companion/id1127108818"
      },
      {
        "label": "Google Play",
        "href": "https://play.google.com/store/apps/details?id=com.ea.gp.fifaultimate&hl=en_US"
      },
      {
        "label": "Web App",
        "href": "https://www.easports.com/fifa/ultimate-team/web-app/"
      }
    ],
    "hard_skills": [
      "JavaScript",
      "LESS",
      "TypeScript",
      "Python",
      "Java",
      "REST"
    ],
    "bullet_points": [
      "Plan, scope, and implement new features for current and future releases of the FIFA Ultimate Team Companion apps (FUT19, FUT20).",
      "Oversee integration of brand-new 'vanity' items to FUT User Clubs in FIFA20, including API call structure, asset automation, and view construction.",
      "Take on Live Content responsibilities such as coordinating roll-outs of exclusive timed campaigns for FUT Companions.",
      "Rewrite legacy tools for parsing app metadata, from older Java and C# to Python.",
      "Prevent content leaks and reduce build times by exposing and resolving issues in 2D asset pipeline.",
      "Fix bugs in FIFA Ultimate Team live and future builds.",
      "Interface with producers, developers, and testers across Live Content, Server, and Console teams. Communicate between Vancouver, Canada and Bucharest, Romania."
    ]
  },
  {
    "id": 3,
    "header": "Electronic Arts Canada",
    "title": "Associate Technical Artist",
    "start_date": "2016-06-20",
    "end_date": "2017-09-27",
    "links": [],
    "hard_skills": [
      "C#",
      "Windows Presentation Foundation (WPF)",
      "Iron Python / FBScript",
      "Frostbite"
    ],
    "bullet_points": [
      "Create, deploy, and support existing Maya plugins and other packages used by artists on Rigging team, in C# and Python.",
      "Automate mass mesh weight transfers in C# Maya API.",
      "Leverage AGILE principles to plan and develop internal software for Rigging team.",
      "Collect and assess feedback on plugins from users.",
      "Fix visual bugs on assets and animations using node- and timeline-based editors in proprietary Frostbite engine."
    ]
  },
  {
    "id": 2,
    "header": "Tantalus Systems",
    "title": "Test Automation Engineer (Co-op)",
    "start_date": "2014-01-06",
    "end_date": "2014-08-29",
    "links": [],
    "hard_skills": ["Python", "Bottle.py", "jQuery", "Citrix Xen"],
    "bullet_points": [
      "Discuss, plan, and execute web front-end features. Leverage Python Bottle, HTML/CSS, and Javascript to dramatically decrease setup time in regression testing of server features.",
      "At development teams' request, create tool utilizing Python's lxml and etree libraries that composes more thorough build e-mails that identify failed tests tied to closed JIRA issues.",
      "Meet daily with teammates to sync progress and design future plans for automation.",
      "Manage Ubuntu and OEL5.8 VMs used as build machines and test environments."
    ]
  },
  {
    "id": 1,
    "header": "BlackBerry Canada (RIM)",
    "title": "Software Developer (Co-op)",
    "start_date": "2013-01-02",
    "end_date": "2013-08-30",
    "links": [],
    "hard_skills": ["VMWare vSphere", "Jenkins", "Ubuntu LTS"],
    "bullet_points": [
      "Oversee deployment and repeated testing of BES10 servers through Jenkins, Maven, Ant, and VMWare vSphere.",
      "Create, deploy, and re-tool scripts used for generating large amounts of XML. Prepare files in build pipeline for new servers. Manage VM snapshots for production BES testing environment.",
      "Maintain and raise new Windows Server 2008 R2 and Ubuntu 12.04 machines used as test environments and build slaves for the Continuous Integration Team, including testers in Mississauga and Seattle.",
      "Investigate, install, and review third-party plugins for Jenkins before deploying to Continuous Integration Team's production server."
    ]
  }
]
